[
  {
    "path": "posts/2023-04-25-goodreads-database/",
    "title": "Exploring My Goodreads Data",
    "description": "Creating a Database",
    "author": [
      {
        "name": "Jess Hooker",
        "url": {}
      }
    ],
    "date": "2023-04-25",
    "categories": [],
    "contents": "\r\n\r\nBACK\r\n\r\n\r\nThis is the first stage of a project exploring my reading activity from Goodreads. For the initial part of the project, I obtained three raw data from Goodreads:\r\nA CSV file of all of my books on my Goodreads shelves\r\nA JSON object of the activity posted to my Goodreads feed\r\nA JSON object of my book reviews\r\nI utilized Python to read the data files and create a database in MySQL. You can find the Jupyter Notebook for the data upload here. Next steps are to clean and process the data for exploratory analysis and visualizing.\r\nA snapshot of some of the syntax for creating a table in the database using Python.\r\n\r\n# create the activities table\r\ntry:\r\n    conn = mysql.connect(host='', database = 'goodreads', user = '', password = '')\r\n    if conn.is_connected():\r\n        cursor = conn.cursor()\r\n        cursor.execute(\"select database();\")\r\n        record = cursor.fetchone()\r\n        print(\"You're connect to the database:\", record)\r\n        cursor.execute('DROP TABLE IF EXISTS activities;')\r\n        print('Creating table...')\r\n# create the new table\r\n        cursor.execute('''\r\n            CREATE TABLE activities(\r\n                           activity_id int primary key not null,\r\n                           activity_type varchar(255),\r\n                           activity_desc varchar(255),\r\n                           product varchar(255),\r\n                           created_date varchar(255) \r\n                           )''')\r\n        print('activities table is created')\r\n# parse the json data\r\n    for i, item in enumerate(activities_list):\r\n        activity_id = i\r\n        activity_type = item.get('activity_type')\r\n        activity_desc = item.get('activity')\r\n        product = item.get('product')\r\n        created_date = item.get('created_at')\r\n    # pull the data into the database    \r\n        cursor.execute(\r\n                '''\r\n                INSERT INTO goodreads.activities (\r\n                activity_id,\r\n                activity_type,\r\n                activity_desc,\r\n                product,\r\n                created_date \r\n                )\r\n                VALUES (%s,%s,%s,%s,%s)\r\n                ''', \r\n                (\r\n                activity_id,\r\n                activity_type,\r\n                activity_desc,\r\n                product,\r\n                created_date,\r\n              )                \r\n            )\r\n        print(\"record inserted\")\r\n    conn.commit()\r\nexcept Error as e:\r\n    print(\"Error while connecting to MySQL\", e)       \r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-04-25-goodreads-database/goodreads_sql_preview.png",
    "last_modified": "2023-04-25T20:44:21-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-31-us-wealth/",
    "title": "A Look at US Wealth",
    "description": {},
    "author": [
      {
        "name": "Jess Hooker",
        "url": {}
      }
    ],
    "date": "2023-03-31",
    "categories": [],
    "contents": "\r\n\r\nBACK\r\n\r\n\r\nThis was collaborative project exploring wealth data from the US Census Bureau. We have created a series of visualizations exploring the distribution of US wealth across wealth percentile groups, income percentile groups, education levels, and generation. These visuals were created with quarterly data from the third quarter of 1989 to the third quarter of 2022 gathered by the US Census Bureau. You can view the final project here.\r\nIn each visualizations we explored key characteristics contributing to wealth in the US over the last 33 years. All together, it’s clear the college-educated and those in the Baby Boomer generation consistently held a significant proportion of the wealth in this country. We also observed large disparities in wealth when it comes to examining both income and wealth percentiles, with those in the 50th percentile and below holding less 15% of nation’s wealth across both metrics.\r\n\r\n\r\n\r\nFigure 1: This plot represents US wealth in trillions of dollars from 1989 to 2022. Each color represents a generation in addition to total wealth of the US. As we can see, the rate of change in wealth over time is not equitable across generations, with the Silent and Earlier and Millennial Generations showing relatively stable amounts of wealth over time. This is likely related to age, as the Silent and Earlier generation has aged into retirement during this period while the Millennial have only recently reached young to middle adulthood. The Baby Boomer and Gen X show very similar patterns of growth over time.\r\n\r\n\r\n\r\nTo create this project, we used Jupyter Notebooks to process the data and develop the visualizations. Then, I used python within R Markdown to design and render this page as HTML. You can find the source code for this project on GitHub.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-03-31-us-wealth/wealth_preview.png",
    "last_modified": "2023-04-25T20:42:09-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-22-watereda/",
    "title": "Exploratory Analysis of Water Samples",
    "description": {},
    "author": [
      {
        "name": "Jess Hooker",
        "url": {}
      }
    ],
    "date": "2022-12-14",
    "categories": [],
    "contents": "\r\n\r\nBACK\r\n\r\n\r\nPredicting the Potability of Water\r\nThis is the first part of an exploratory data analysis project examining characteristics of about 3000 water samples in relation to potability. I obtained this data project as part of the beta testing of the Lonely Octopus. It comprises 9 primary water sampling characteristics and a binary outcome indicating the sample was potable or not. In the first stage of this project, I focused utilizing loops in python to visualize the data. You can preview the results here and find the Jupyter Notebook syntax on GitHub.\r\n\r\n\r\n\r\nFigure 1: A correlation plot of each of the 9 water potability characteristics.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-12-22-watereda/water_eda.png",
    "last_modified": "2023-04-25T20:35:00-04:00",
    "input_file": {}
  }
]
